use deinflect::Deinflections;

fn main() {
    // creating cache for deinflections
    std::hint::black_box(Deinflections::from_str(S));

    let mut s = String::new();
    for _ in 0..10000 {
        s.push_str(S);
    }

    let now = std::time::Instant::now();
    let _ = std::hint::black_box(Deinflections::from_str(&s));
    let elapsed = now.elapsed();
    println!(
        "deinflected {} possible words in {:?}",
        s.chars().count(),
        elapsed
    );
}

const S: &str = "念かて道頭ぎ造応よさ東隊とげよの向答カネ郵注覧も歩典ゆづ転81短ラテムネ禁社くんラ梗表ヲシレネ感楽ふ掲勝スネヒイ作覇吾ぎレド。共ソナヨモ芸表うゅ思非ヌセハサ毅話フソリユ検94県激8味紅魅ねト円載発ぴこあ混日ド市輸樹形ゆ。断択ツエ撃良ヒオツタ近市ホヤ供用イレキサ山歩クふげ禁性レへっわ臣91過世む朝愛中書セニ再元タカシ様象ネ色年案ミキヘヱ紙会ぽめあれ極宗にぱ力票ひ明館いまみき。

化流もぼほの日暮がぽて人社スマモ暮岡場ノレヌロ震連ま誉広当リ江習ハ海月せレ断仙限ニフ引解エモサ旅顕ヲシ日子ルキ禁銀囲もに績63整憂ぽへレ。7面ウオヱエ売本イぼ意国ばょぽ最話んぽあ度森ぶ不氏レせ京36総レうもた更埋ムヱ山試マ記柏ゅい吾首ヘミロヌ者協臓圏ま。46局育さ芸販祭ト境辱っめげぐ越雅習ヤ上応止ゅースち道限ざみ都民っおつラ新介メロノ以周つぐと権抜ス。

会めせ約災ゃがッや能玲たクや全前ぐぼゆて質下えもた教亀ヤサ抱駒セ因康ヘ職語ふ郎7信ハム部敗実偵トざじて。府ム和探リサミイ経事今日スべ舞社シフユ読綿ま入95良ニハアス村収図呼コヨヤ能画受ヘ写容イ員計さご外危のせょ。結しゅ憲向ひべわょ無能モソシ動込シレツム政知さべこち録66留悪本1紙人クトケニ掲去全るあ年87業せだれざ級徳ヘタ混稿ゆこやろ見罰解す理七イ。

技ハルヌ毒販り城授エトヨウ函花ニ嘘本安セツリ売74禁トエヨロ問載をドちう知授オルロ局無ヤシニ新疑転ざッ川遺づじンご現橋ばいや意儀問トレシメ更代ホタヱ改済でおまべ度情趣排撲だ。一てトぜぶ総選ひ丘付ゆて姿画げで北不クく皇著ワクスヱ稿1木マメ最町試ひし内便和ろきやみ星育ソスモノ中免っ決酒彼精りつの。困チソタヱ麻6思ヱカ込87確ひ文動イムホセ管能係そ送必業48最につぐク堀局やどろだ闘材造さかと。

域づにめ探彩ヲホユツ通日ヌコ購辞ヱノモ達査人にざフ込6講ヌ擁謝還ヲイメ撤組レ基線飛ネケセシ声討げリない堀行まざ堀在文わび討知砂翼奈れ。待ホフミワ地級費必意ラエアヨ改6運なま川政えば雪協司ネシフ格著らぱ判欲んゅスつ覧4社ヱミス治個わ少備リスだま事津の覧版ヒ芸改ワロト能乙吟噛堰ぼだぽ。

康をイげ各態島ど興板とろよッ性見ニヘ育投ず上7係ぐふ要車ド芸転エク変記メ太東リ地開ス動強イ狭本マ次18時ソ考殺賀厘架りのぎら。朝ひょ字人属横タニソ掲投せした抗放ーくスも必軽うさフ道毎判ツヒ著合じけかば月処生ルよひぶ作営ニアヌム話接い手速ど訪再ま稿美カト果列岸仏びよッそ。

行予本や組敗かぽラ計脳ニ水針遅マルオ理問キクヲ宝仕キルオシ立真へをでス提界めてれぞ目公ソユ品日むフぎっ著変大づイび投塾ヲスイ際政修級追きラリ。部ミサ予賞ふやクぞ竹初むき伴率ヨムルヤ沢本イ持56尾要づむリ色衝めトぐ推物最ちゅ用氷93米ストけ惑年かこ疲示旧てたトと討新ラ外模走全紙ひぴ。

保ゃ勝報テマタ行激トヲユミ立率ハモ載坊ほ段王ゆゃに院疑うなル豚73音無限ほ金陽メモ全3日ルニ闘場んげ図改トウ世著カヨ後航むてど服本ゃでょ子侃凸塀婆ぎ。要部フメ官柳者すどっち読不独ホ森23太リけは決板べ践追機ぴばすま再誇ぎ針9有んじゃご囲脅カスサ題費ハオヘス旅碁だく文導億討宙スで。

炊メネニル細14通商ゆル新98新ょごじと年奮念まゆー債治ム求集直ナサルヱ役発べふそ車査ら択意モ国認メセナ棋賀ゅじり。評ニマ変方クセ体頑中業セニ栩動まる阜会ハヨ教分し景放ぶびク書今オヤネ編比むろたド書球68夜ウヨ染26板ぱラべ。野ぞイほ気香制銭報ニタヤヌ半市んろみ早課モヱツニ細代べぜへく館90年っ昭予ネハ骨化ろすせ旅半で。

72本委ヱ授連張チ狭生ルす務12面おゃぞ雄積ゆなもみ新78最ッざ高転あ電句せも。体京レん止将っげぶぽ教語谷ウムスモ信医メセ英沖容働レユ禁札え前意オニチ部本モ査振ぽ燥月さト教並ぜらぼめ応随っへンリ択化ーイクリ風宮えラ。復クリ業内ユヌワミ稿研トヨオ予者ロ指縁チロキサ氏県つ国5稿っぞしげ聞評報ヨヤラ立削貝ヘ視経軍クあょみ件等ろレぐぞ天均レウノリ九千まむぽぼ話防急あねやち。";
